announcements/stumpwm-setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-09-07 Mon 14:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacspeak support for StumpWM</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="raman" />
</head>
<body>
<div id="content">
<h1 class="title">Emacspeak support for StumpWM</h1>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Summary:</h2>
<div class="outline-text-2" id="text-1">
<p>
Describes my Linux X-Windowing setup using <b>lightdm</b> to initialize the desktop and StumpWM configured as a talking Window Manager.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Overview</h2>
<div class="outline-text-2" id="text-2">
<p>
File <code>stumpwmrc</code> is my StumpWM init file that  I use to set up
StumpWM as a talking window manager.  With this setup, I run Emacs in
one window and Chrome+ChromeVox in another window. 
</p>

<p>
File <code>xsession</code> is my <code>.xsession</code> file  &#x2014; it launches StumpWM once <code>lightdm</code> has finished authentication.
You can find my <code>lightdm</code> setup files in  directory <code>emacspeak/tvr/lightdm</code>.
</p>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Contents</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt>tts.lisp</dt><dd>Interface to Emacspeak TTS  servers.</dd>
<dt>stumpwmrc</dt><dd>Code to insert into personal =.stumpwmr</dd>
<dt>xsession- </dt><dd>My= .xsession= file.</dd>
<dt>xlock</dt><dd>A light-weight screen-lock script.</dd>
</dl>
</div>
</div>



<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Resulting Functionality</h2>
<div class="outline-text-2" id="text-4">
<p>
To set this up, You should only need to edit the value of
<code>*emacspeak-dir*</code> in the <code>stumpwmrc</code> file for setup.
</p>

<ol class="org-ol">
<li>All Keybindings  match my usual <code>screen</code> setup, including the window-manager prefix-key.</li>
<li>C-\ is the window-manager key.</li>
<li>Switching windows speaks the title of the new window.</li>
<li>Stumpwm command for displaying window list <code>C-\w</code> also speaks the output.</li>
<li>The init file provides a simple lock-screen command bound to <code>C-\d</code>.</li>
<li>The above lock command invokes shell script <code>xlock</code> &#x2014; that script takes care of playing an auditory icon when the desktop is locked or unlocked.</li>
<li>Window manager messages speak automatically; this can be toggled with <code>C-\t</code>.</li>
<li>If there is a lot of activity in a window that is not focused,
you can turn off automatic speaking of messages using <code>C-\t</code> to
avoid distraction.</li>
<li>StumpWM is set up to deny raise-focus requests &#x2014; this is so that activity in a window doesn't automatically grab focus.
I typically run with only one window displayed at a time.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-09-07 Mon&gt;</span></span></p>
<p class="author">Author: raman</p>
<p class="date">Created: 2015-09-07 Mon 14:42</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
